<template><div><p>说到物质，除了物理科学实在上的那个物质，还有另一种，那就是金钱财富权力的物质。我在这里要谈的物质，是更接近后者的一个物质，这里的物质更加让人羞耻，无法直视，也因此更有的谈。</p>
<p>我们说我们是唯物主义，说起物质难道就只是指指石头说这个是物质吗？再或，我们说的物质难道还能是金钱？那又和那群拜金、享乐主义的家伙，和那些恋物癖又有什么区别？ps:虽然...但其实我觉得有些恋物癖也挺可爱的。</p>
<hr>
<p>施工ing</p>
<hr>
<p>我，就是力量的化身。</p>
<hr>
<p>我们不相信老爷们的善心，我们相信自己的拳头与枪杆。</p>
<blockquote>
<p>吃软不吃硬，在这句狗屁之后我想到的一句是“你想打倒我？凭什么？” <br>
吃软不吃硬想说的无非是自己是硬的，所以对方必须得是tmd软的，自己是软的，但是自己的软是装的，骨子里硬。我不知道这句话一开始是tmd什么意思，但是昨晚从那个垃圾嘴里说出来的就是这种恶心人的玩意。<br>
还tm尊重？不好意思，对朋友，真正的尊重就是来硬的，对垃圾，最正确的处理方法就是碾成渣。<br>
我会想要把这句话的反面说通——“吃硬不吃软”。我所珍视的一切我都会让它们变成最坚硬最不可摧毁的东西，而那些垃圾们不管它们是软是硬都tmd给我灰飞烟灭。</p>
</blockquote>
<hr>
<p><RouterLink to="/posts/learn-dialectic/formalism.md/#%E4%B8%BA%E4%BB%80%E4%B9%88%E6%88%91%E6%98%AF%E4%B8%80%E4%B8%AA%E5%BD%A2%E5%BC%8F%E4%B8%BB%E4%B9%89%E8%80%85">阶级斗争</RouterLink>就是物质！<br>
<RouterLink to="/posts/learn-dialectic/Anfang/anfang.md/#%E5%8E%86%E5%8F%B2">历史</RouterLink>不会为那些想要以迂腐的样子千秋万代的人所变动！<br>
革命一定会成功，共产主义一定会实现！<br>
这就是物质！\</p>
</div></template>


