<template><div><p>感觉，可以把整网站这一条东西记录一下...</p>
<h3 id="与代码无关" tabindex="-1"><a class="header-anchor" href="#与代码无关" aria-hidden="true">#</a> 与代码无关</h3>
<p>其实从头到尾难的...或者说磕到我的地方根本就不是代码...或者说我几乎一行没写......<br>
vuepress，主体也是一个写好的 vuepress hope<br>
这里面我做的基本就只有换壳，就是，改个名字改图片那种。<br>
有点要写的地方也就...配侧边栏，还有 markdown 的 frontmatter...<br>
因为是静态所以要去找别人提供的在线服务...接 github 的评论功能，评论用 GitHub 提供的好处是一条龙，坏处是别人要评论就要有 github 账号...，现在要整的是一个搜索功能，也是要去找爬虫。。</p>
<p>做完之后 yarn build 把 dist 丢到 github pages 就好了....但我绕了一大圈....</p>
<h3 id="正确的操作" tabindex="-1"><a class="header-anchor" href="#正确的操作" aria-hidden="true">#</a> 正确的操作</h3>
<p>github pages 提供的服务大概有点问题，稍微炫酷点的特效丢上去基本就是 gg，或者是 vuepress 或者这个主题的问题，我加了.nojekyll 文件也没用。所以要自己找服务器去部署。<br>
正确的做法应该是去找腾讯阿里这种直接提供一条龙服务的，装个宝塔面板啥的，这样弄服务器配 nginx，买域名，之后的 https 基本几下就完事...可能就各种实名认证比较烦。<br>
但是，很明显，我没有这样走下去。。。其实到现在，那个 namecheap 开了好几个工单，它说好的 ssl 证书还是没整好。嗯，是我操作的问题，也有我看不懂那些英文的问题，但填错了信息但前台没法改这个也挺艹的。说真的，这些外国的网站，可能因为公司又小又老？...反而不如国内的那些网站看起来干净又炫酷。</p>
<h3 id="折腾" tabindex="-1"><a class="header-anchor" href="#折腾" aria-hidden="true">#</a> 折腾</h3>
<p>可能要从月初我去弄 github 的学生包开始...我也不知道为啥突然想搞，也没啥具体想做的，也许是想走一遍流程，再或就是单纯的想去嫖。<br>
折腾了大概两天搞到了，里面对网站部署有用的大概是 digitalOcean 的一年期限的 200$，还有 azure 的一堆（这个我现在还没搞定，跟客服扯皮中），namecheap 和 namecom（这玩意也是用不了，一到购物车就说我信息不完整）俩域名提供商。<br>
怎么说，digitalOcean 花了我三十多块去激活账户，namecheap 倒是没花钱但是很坑人，就那个 ssl 折腾了我好几天还没弄好...之后又去找了腾讯的域名注册，我不知道腾讯是咋搞的，我服务器在外网哎...我连 csr 都没提供就给了我一套 key 和 crt，结果丢上去还是能用的。。。之后部署 discourse 也是，问都没问我就自动添了 https，就在我 namecheap 搞到的域名上。</p>
<p>update:又过了一段时间，azure 学生认证扯皮了半天终于弄好了。上有一个免费部署静态网页的服务，放 vuepress hope 完全没问题，只要再有一个域名就可以了，也是自动配 https。</p>
<h3 id="折腾之后" tabindex="-1"><a class="header-anchor" href="#折腾之后" aria-hidden="true">#</a> 折腾之后</h3>
<p>嗯，绕圈也有值的地方，就比如国内的服务器下个东西动不动就被拦被干趴，动不动就要再配镜像源甚至手动上传...git 都用不顺溜，但是用国外的就没有这种烦恼。虽然我花了三十多块和十几天的时间（其实从九月下旬一直在生病...感冒拉肚子断断续续的，这周末还要体侧，rnm），但是整到了应该够玩上一年的的玩意....就是 digitalOcean 那边的 200 那个玩意。</p>
<p>update:之后又尝试用这些东西架梯子...然而没几天就没干掉，重开服务器也是有些机子一开始就连不通...太坏了。</p>
<h3 id="折腾之前" tabindex="-1"><a class="header-anchor" href="#折腾之前" aria-hidden="true">#</a> 折腾之前</h3>
<p>或者应该从九月下旬开始看？9.19 我去整了腾讯云的免费试用，那时候我啥都不知道来着......宝塔大概帮了挺大忙......大概是从 java 和前端的部署开始的。<br>
然后同时也想把写的东西弄得炫酷点（视觉上），去看了一堆，其实好久都不确定要用什么...然后翻到了之前看到的那个 mtf wiki，找到了 vuepress 的 hope 这个主题。其实我对编程有了解，还有之后选了计算机软工这类专业，也不是我自己喜欢...也是看到了才...但是现在还是没人陪我玩...啊啊啊啊</p>
<p>又想到了个许久之前就有的圈圈。其实，一开始因为腾讯云的试用有期限我好几次觉得“不是时候”，现在弄有点浪费之类的 bulabula，但是能让时候“是时候” 的，并不是等待或者做别的什么“准备”，而是直接开始——只有，唯有在<RouterLink to="/posts/learn-dialectic/Anfang/anfang.md/#%E9%94%99%E8%AF%AF%E5%87%BA%E7%9C%9F%E7%9F%A5">开始</RouterLink>这一个办法才能真正的把“准备”做好。</p>
<p><img src="@source/posts/CS/helloworld/screenshots/QQ截图20221015075652.png" alt="digitalOecan" loading="lazy"></p>
</div></template>


